Tekla.Structures.ModelInternal.RebarLegFace.SurfaceTypeEnum
The Surface Type.

Tekla.Structures.ModelInternal.RebarLegFace.SurfaceTypeEnum.PLANE
The Plane surface type.

Tekla.Structures.ModelInternal.RebarLegFace.SurfaceTypeEnum.CYLINDER
The Cylinder surface type.